app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "author", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Method-Man"], ["author", "Wu-Tang Clan"], ["time", "3:12"], ["created_at", "2021-02-26 19:43:06.032355"], ["updated_at", "2021-02-26 19:43:06.032355"]]